benchmarks/vllm/runpod_h100sxm/Qwen3-32B/qwen3_32b_TP4_DP2_in128_out128_p1000_c25_135970.txt
BENCHMARK: qwen3_32b_TP4_DP2_in128_out128_p1000_c25_135970
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x71c8865a8ea0>, seed=0, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=25, model='/root/models/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Qwen3-32B', result_filename='qwen3_32b_TP4_DP2_in128_out128_p1000_c25_135970.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-8a6e21e2-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-10 09:50:57 [datasets.py:612] Sampling input_len from [128, 128] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:01<21:42,  1.30s/it]
  3%|▎         | 26/1000 [00:02<01:23, 11.67it/s]
  5%|▌         | 51/1000 [00:03<01:02, 15.28it/s]
  8%|▊         | 76/1000 [00:05<00:54, 16.94it/s]
 10%|▉         | 99/1000 [00:05<00:34, 25.87it/s]
 11%|█         | 109/1000 [00:06<00:48, 18.42it/s]
 13%|█▎        | 126/1000 [00:07<00:52, 16.69it/s]
 15%|█▍        | 148/1000 [00:07<00:33, 25.15it/s]
 16%|█▌        | 158/1000 [00:09<00:46, 17.96it/s]
 18%|█▊        | 176/1000 [00:10<00:48, 16.84it/s]
 19%|█▉        | 191/1000 [00:10<00:36, 22.43it/s]
 20%|██        | 201/1000 [00:11<00:47, 16.66it/s]
 22%|██▏       | 215/1000 [00:11<00:34, 22.54it/s]
 23%|██▎       | 226/1000 [00:12<00:46, 16.71it/s]
 24%|██▍       | 240/1000 [00:12<00:32, 23.04it/s]
 25%|██▌       | 251/1000 [00:14<00:44, 16.77it/s]
 27%|██▋       | 266/1000 [00:14<00:31, 23.66it/s]
 28%|██▊       | 276/1000 [00:15<00:43, 16.62it/s]
 29%|██▉       | 291/1000 [00:15<00:29, 23.84it/s]
 30%|███       | 301/1000 [00:16<00:42, 16.54it/s]
 32%|███▏      | 317/1000 [00:16<00:28, 23.88it/s]
 33%|███▎      | 326/1000 [00:17<00:41, 16.44it/s]
 34%|███▍      | 342/1000 [00:18<00:27, 23.97it/s]
 35%|███▌      | 351/1000 [00:19<00:39, 16.44it/s]
 37%|███▋      | 367/1000 [00:19<00:26, 23.96it/s]
 38%|███▊      | 376/1000 [00:20<00:37, 16.43it/s]
 39%|███▉      | 392/1000 [00:20<00:25, 23.95it/s]
 40%|████      | 401/1000 [00:21<00:36, 16.44it/s]
 42%|████▏     | 417/1000 [00:21<00:24, 23.90it/s]
 43%|████▎     | 426/1000 [00:22<00:34, 16.43it/s]
 44%|████▍     | 442/1000 [00:23<00:23, 23.96it/s]
 45%|████▌     | 451/1000 [00:24<00:33, 16.43it/s]
 47%|████▋     | 467/1000 [00:24<00:22, 23.93it/s]
 48%|████▊     | 476/1000 [00:25<00:31, 16.41it/s]
 49%|████▉     | 492/1000 [00:25<00:21, 23.93it/s]
 50%|█████     | 500/1000 [00:25<00:17, 27.96it/s]
 51%|█████     | 508/1000 [00:26<00:28, 17.21it/s]
 52%|█████▏    | 517/1000 [00:26<00:21, 21.96it/s]
 52%|█████▏    | 524/1000 [00:27<00:18, 26.02it/s]
 53%|█████▎    | 531/1000 [00:28<00:31, 15.04it/s]
 54%|█████▍    | 542/1000 [00:28<00:21, 21.64it/s]
 55%|█████▌    | 550/1000 [00:28<00:16, 26.94it/s]
 56%|█████▌    | 557/1000 [00:29<00:29, 15.03it/s]
 57%|█████▋    | 568/1000 [00:29<00:20, 21.16it/s]
 58%|█████▊    | 576/1000 [00:30<00:30, 13.94it/s]
 59%|█████▉    | 592/1000 [00:30<00:17, 22.85it/s]
 60%|█████▉    | 599/1000 [00:30<00:15, 26.71it/s]
 61%|██████    | 606/1000 [00:31<00:25, 15.37it/s]
 62%|██████▏   | 618/1000 [00:32<00:17, 22.01it/s]
 63%|██████▎   | 626/1000 [00:33<00:25, 14.47it/s]
 64%|██████▍   | 642/1000 [00:33<00:15, 23.20it/s]
 65%|██████▍   | 649/1000 [00:33<00:13, 26.95it/s]
 66%|██████▌   | 656/1000 [00:34<00:22, 15.62it/s]
 67%|██████▋   | 668/1000 [00:34<00:14, 22.18it/s]
 68%|██████▊   | 676/1000 [00:35<00:22, 14.44it/s]
 69%|██████▉   | 692/1000 [00:35<00:13, 23.35it/s]
 70%|███████   | 700/1000 [00:35<00:10, 27.71it/s]
 71%|███████   | 708/1000 [00:37<00:17, 16.48it/s]
 72%|███████▏  | 718/1000 [00:37<00:12, 21.75it/s]
 73%|███████▎  | 726/1000 [00:38<00:19, 14.16it/s]
 74%|███████▍  | 742/1000 [00:38<00:11, 23.14it/s]
 75%|███████▌  | 750/1000 [00:38<00:09, 27.57it/s]
 76%|███████▌  | 758/1000 [00:39<00:14, 16.31it/s]
 77%|███████▋  | 768/1000 [00:39<00:10, 21.72it/s]
 78%|███████▊  | 776/1000 [00:40<00:15, 14.08it/s]
 79%|███████▉  | 793/1000 [00:40<00:08, 23.17it/s]
 80%|████████  | 801/1000 [00:42<00:13, 15.21it/s]
 82%|████████▏ | 818/1000 [00:42<00:07, 23.78it/s]
 83%|████████▎ | 826/1000 [00:43<00:11, 15.72it/s]
 84%|████████▍ | 843/1000 [00:43<00:06, 24.03it/s]
 85%|████████▌ | 851/1000 [00:44<00:09, 15.95it/s]
 87%|████████▋ | 868/1000 [00:44<00:05, 24.18it/s]
 88%|████████▊ | 876/1000 [00:45<00:07, 16.07it/s]
 89%|████████▉ | 892/1000 [00:46<00:04, 24.15it/s]
 90%|█████████ | 901/1000 [00:47<00:06, 16.19it/s]
 92%|█████████▏| 915/1000 [00:47<00:03, 23.10it/s]
 92%|█████████▏| 924/1000 [00:47<00:02, 26.89it/s]
 93%|█████████▎| 932/1000 [00:48<00:03, 17.01it/s]
 94%|█████████▍| 944/1000 [00:48<00:02, 22.91it/s]
 95%|█████████▌| 951/1000 [00:49<00:03, 14.80it/s]
 96%|█████████▌| 962/1000 [00:49<00:01, 20.60it/s]
 97%|█████████▋| 970/1000 [00:49<00:01, 24.71it/s]
 98%|█████████▊| 977/1000 [00:50<00:01, 15.03it/s]
 99%|█████████▉| 990/1000 [00:51<00:00, 22.90it/s]
100%|█████████▉| 998/1000 [00:51<00:00, 27.29it/s]
100%|██████████| 1000/1000 [00:51<00:00, 19.52it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Maximum request concurrency:             25        
Benchmark duration (s):                  51.22     
Total input tokens:                      128000    
Total generated tokens:                  128000    
Request throughput (req/s):              19.52     
Output token throughput (tok/s):         2498.80   
Peak output token throughput (tok/s):    2655.00   
Peak concurrent requests:                50.00     
Total token throughput (tok/s):          4997.60   
---------------Time to First Token----------------
Mean TTFT (ms):                          51.71     
Median TTFT (ms):                        48.33     
P99 TTFT (ms):                           110.23    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          9.64      
Median TPOT (ms):                        9.65      
P99 TPOT (ms):                           9.76      
---------------Inter-token Latency----------------
Mean ITL (ms):                           9.64      
Median ITL (ms):                         9.44      
P99 ITL (ms):                            14.63     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1276.59   
Median E2EL (ms):                        1274.05   
P99 E2EL (ms):                           1326.33   
==================================================